In [156]:
import pandas as pd

In [157]:
df= pd.read_excel('https://github.com/chris78rey/DIPLOM_BIGDATA/blob/main/DATOS200.xlsx?raw=true')

In [158]:
df

    CATEGORIA  VALOR  VALOR 2           Date&Time
0       Item4   87.0      NaN 2021-08-01 18:07:20
1        Item   46.0    45.58 2021-08-03 14:08:50
2       Item5   84.0    84.28 2021-08-05 10:10:21
3       Item0   35.0    35.04 2021-08-07 06:11:51
4       Item2   10.0    10.25 2021-08-09 02:13:22
..        ...    ...      ...                 ...
195     Item3   46.0    46.04 2022-07-25 11:01:18
196     Item1   27.0      NaN 2022-07-27 07:02:49
197     Item2   96.0    95.71 2022-07-29 03:04:19
198       NaN   76.0    75.59 2022-07-30 23:05:50
199     Item4    NaN    82.98                 NaT

[200 rows x 4 columns]

In [159]:
df.reset_index

<bound method DataFrame.reset_index of     CATEGORIA  VALOR  VALOR 2           Date&Time
0       Item4   87.0      NaN 2021-08-01 18:07:20
1        Item   46.0    45.58 2021-08-03 14:08:50
2       Item5   84.0    84.28 2021-08-05 10:10:21
3       Item0   35.0    35.04 2021-08-07 06:11:51
4       Item2   10.0    10.25 2021-08-09 02:13:22
..        ...    ...      ...                 ...
195     Item3   46.0    46.04 2022-07-25 11:01:18
196     Item1   27.0      NaN 2022-07-27 07:02:49
197     Item2   96.0    95.71 2022-07-29 03:04:19
198       NaN   76.0    75.59 2022-07-30 23:05:50
199     Item4    NaN    82.98                 NaT

[200 rows x 4 columns]>

In [160]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   CATEGORIA  196 non-null    object
 1   VALOR      185 non-null    float64
 2   VALOR 2    193 non-null    float64
 3   Date&Time  190 non-null    datetime64[ns]
dtypes: datetime64[ns](1), float64(2), object(1)
memory usage: 6.4+ KB

In [161]:
new_var = df.groupby(['CATEGORIA'])
df_grupo_suma=new_var

In [162]:
dir(df_grupo_suma)

['CATEGORIA',
 'VALOR',
 '__annotations__',
 '__class__',
 '__class_getitem__',
 '__delattr__',
 '__dict__',
 '__dir__',
 '__doc__',
 '__eq__',
 '__format__',
 '__ge__',
 '__getattr__',
 '__getattribute__',
 '__getitem__',
 '__gt__',
 '__hash__',
 '__init__',
 '__init_subclass__',
 '__iter__',
 '__le__',
 '__len__',
 '__lt__',
 '__module__',
 '__ne__',
 '__new__',
 '__orig_bases__',
 '__parameters__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__setattr__',
 '__sizeof__',
 '__slots__',
 '__str__',
 '__subclasshook__',
 '__weakref__',
 '_accessors',
 '_agg_examples_doc',
 '_agg_general',
 '_agg_py_fallback',
 '_aggregate_frame',
 '_aggregate_item_by_item',
 '_aggregate_with_numba',
 '_apply_allowlist',
 '_apply_filter',
 '_apply_to_column_groupbys',
 '_ascending_count',
 '_bool_agg',
 '_can_use_transform_fast',
 '_choose_path',
 '_concat_objects',
 '_constructor',
 '_cumcount_array',
 '_cython_agg_general',
 '_cython_transform',
 '_define_paths',
 '_descending_count',
 '_dir_additions',
 '_dir_deletions',
 '_fill',
 '_get_cythonized_result',
 '_get_data_to_aggregate',
 '_get_index',
 '_get_indices',
 '_gotitem',
 '_group_selection',
 '_group_selection_context',
 '_hidden_attrs',
 '_indexed_output_to_ndframe',
 '_insert_inaxis_grouper_inplace',
 '_internal_names',
 '_internal_names_set',
 '_is_protocol',
 '_iterate_column_groupbys',
 '_iterate_slices',
 '_make_mask_from_int',
 '_make_mask_from_list',
 '_make_mask_from_positional_indexer',
 '_make_mask_from_slice',
 '_make_mask_from_tuple',
 '_make_wrapper',
 '_mask_selected_obj',
 '_numba_agg_general',
 '_numba_prep',
 '_obj_1d_constructor',
 '_obj_with_exclusions',
 '_positional_selector',
 '_python_agg_general',
 '_python_apply_general',
 '_reindex_output',
 '_reset_cache',
 '_reset_group_selection',
 '_resolve_numeric_only',
 '_selected_obj',
 '_selection',
 '_selection_list',
 '_set_group_selection',
 '_set_result_index_ordered',
 '_transform',
 '_transform_general',
 '_transform_item_by_item',
 '_transform_with_numba',
 '_wrap_agged_manager',
 '_wrap_aggregated_output',
 '_wrap_applied_output',
 '_wrap_applied_output_series',
 '_wrap_transform_fast_result',
 '_wrap_transformed_output',
 'agg',
 'aggregate',
 'all',
 'any',
 'apply',
 'backfill',
 'bfill',
 'boxplot',
 'corr',
 'corrwith',
 'count',
 'cov',
 'cumcount',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'describe',
 'diff',
 'dtypes',
 'ewm',
 'expanding',
 'ffill',
 'fillna',
 'filter',
 'first',
 'get_group',
 'groups',
 'head',
 'hist',
 'idxmax',
 'idxmin',
 'indices',
 'last',
 'mad',
 'max',
 'mean',
 'median',
 'min',
 'ndim',
 'ngroup',
 'ngroups',
 'nth',
 'nunique',
 'ohlc',
 'pad',
 'pct_change',
 'pipe',
 'plot',
 'prod',
 'quantile',
 'rank',
 'resample',
 'rolling',
 'sample',
 'sem',
 'shift',
 'size',
 'skew',
 'std',
 'sum',
 'tail',
 'take',
 'transform',
 'tshift',
 'value_counts',
 'var']

In [163]:
df_grupo_suma.sum()

            VALOR  VALOR 2
CATEGORIA
Item       1396.0  1517.74
Item0       974.0   971.21
Item1      1238.0  1332.53
Item2      1413.0  1443.38
Item3      1539.0  1617.75
Item4      1294.0  1289.61
Item5      1127.0  1127.35
Item6      1561.0  1653.11

In [164]:
type(df_grupo_suma.sum())

pandas.core.frame.DataFrame

In [165]:
df2=df.describe()

In [166]:
df2

            VALOR     VALOR 2
count  185.000000  193.000000
mean    58.432432   58.135803
std     27.988876   27.723866
min     10.000000   10.010000
25%     33.000000   33.050000
50%     58.000000   58.210000
75%     84.000000   83.480000
max    100.000000   99.620000

In [167]:
df2.loc[['count','std'],'VALOR']

count    185.000000
std       27.988876
Name: VALOR, dtype: float64

In [168]:
df3=df.T

In [169]:
df3

,0,1,2,3,4,5,6,7,8,9,...,190,191,192,193,194,195,196,197,198,199
CATEGORIA,Item4,Item,Item5,Item0,Item2,NaN,Item0,Item0,Item4,Item6,...,Item0,Item6,Item3,Item5,Item2,Item3,Item1,Item2,NaN,Item4
VALOR,87.0,46.0,84.0,35.0,10.0,89.0,NaN,58.0,83.0,NaN,...,79.0,21.0,NaN,90.0,35.0,46.0,27.0,96.0,76.0,NaN
VALOR 2,NaN,45.58,84.28,35.04,10.25,89.42,59.37,57.97,83.13,67.55,...,78.81,21.2,80.82,89.86,34.77,46.04,NaN,95.71,75.59,82.98
Date&Time,2021-08-01 18:07:20,2021-08-03 14:08:50,2021-08-05 10:10:21,2021-08-07 06:11:51,2021-08-09 02:13:22,NaT,2021-08-12 18:16:23,2021-08-14 14:17:53,2021-08-16 10:19:24,2021-08-18 06:20:54,...,2022-07-16 06:53:46,2022-07-18 02:55:16,2022-07-19 22:56:47,2022-07-21 18:58:17,NaT,2022-07-25 11:01:18,2022-07-27 07:02:49,2022-07-29 03:04:19,2022-07-30 23:05:50,NaT

In [170]:
df.axes

[RangeIndex(start=0, stop=200, step=1),
 Index(['CATEGORIA', 'VALOR', 'VALOR 2', 'Date&Time'], dtype='object')]

In [171]:
df.dtypes

CATEGORIA            object
VALOR               float64
VALOR 2             float64
Date&Time    datetime64[ns]
dtype: object

In [172]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   CATEGORIA  196 non-null    object
 1   VALOR      185 non-null    float64
 2   VALOR 2    193 non-null    float64
 3   Date&Time  190 non-null    datetime64[ns]
dtypes: datetime64[ns](1), float64(2), object(1)
memory usage: 6.4+ KB

In [173]:
df.empty

False

In [174]:
df.rank()

     CATEGORIA  VALOR  VALOR 2  Date&Time
0        136.5  145.0      NaN        1.0
1         12.5   68.0     69.0        2.0
2        158.0  138.0    147.0        3.0
3         34.5   50.5     55.0        4.0
4         84.0    2.0      2.5        5.0
..         ...    ...      ...        ...
195      110.5   68.0     70.0      187.0
196       58.0   35.5      NaN      188.0
197       84.0  172.5    178.0      189.0
198        NaN  116.5    123.0      190.0
199      136.5    NaN    142.0        NaN

[200 rows x 4 columns]

In [175]:
i=df.ndim

In [176]:
i

2

In [177]:
df.shape

(200, 4)

In [178]:
df.size

800

In [179]:
df.values

array([['Item4', 87.0, nan, Timestamp('2021-08-01 18:07:20')],
       ['Item', 46.0, 45.58, Timestamp('2021-08-03 14:08:50')],
       ['Item5', 84.0, 84.28, Timestamp('2021-08-05 10:10:21')],
       ['Item0', 35.0, 35.04, Timestamp('2021-08-07 06:11:51')],
       ['Item2', 10.0, 10.25, Timestamp('2021-08-09 02:13:22')],
       [nan, 89.0, 89.42, NaT],
       ['Item0', nan, 59.37, Timestamp('2021-08-12 18:16:23')],
       ['Item0', 58.0, 57.97, Timestamp('2021-08-14 14:17:53')],
       ['Item4', 83.0, 83.13, Timestamp('2021-08-16 10:19:24')],
       ['Item6', nan, 67.55, Timestamp('2021-08-18 06:20:54')],
       ['Item6', nan, 35.21, Timestamp('2021-08-20 02:22:25')],
       ['Item1', nan, 58.46, Timestamp('2021-08-21 22:23:55')],
       ['Item1', nan, 33.26, Timestamp('2021-08-23 18:25:25')],
       ['Item', 94.0, 93.93, Timestamp('2021-08-25 14:26:56')],
       ['Item0', 40.0, 40.39, Timestamp('2021-08-27 10:28:26')],
       ['Item6', 77.0, 77.26, Timestamp('2021-08-29 06:29:57')],
       ['Item1', 12.0, 12.15, Timestamp('2021-08-31 02:31:27')],
       ['Item4', 80.0, 80.36, Timestamp('2021-09-01 22:32:58')],
       ['Item', 54.0, 53.8, Timestamp('2021-09-03 18:34:28')],
       ['Item2', 54.0, 54.13, Timestamp('2021-09-05 14:35:59')],
       ['Item2', 13.0, 12.92, Timestamp('2021-09-07 10:37:29')],
       ['Item2', 45.0, nan, Timestamp('2021-09-09 06:38:59')],
       [nan, 77.0, 76.92, Timestamp('2021-09-11 02:40:30')],
       ['Item0', 66.0, 65.57, Timestamp('2021-09-12 22:42:00')],
       ['Item5', 70.0, 70.33, Timestamp('2021-09-14 18:43:31')],
       ['Item3', 51.0, 50.69, Timestamp('2021-09-16 14:45:01')],
       ['Item6', 97.0, 96.53, Timestamp('2021-09-18 10:46:32')],
       ['Item6', 80.0, 80.18, Timestamp('2021-09-20 06:48:02')],
       ['Item1', 14.0, 13.77, NaT],
       ['Item2', 84.0, 84.39, Timestamp('2021-09-23 22:51:03')],
       ['Item6', 63.0, 62.74, Timestamp('2021-09-25 18:52:34')],
       ['Item', 84.0, 83.63, Timestamp('2021-09-27 14:54:04')],
       ['Item5', 92.0, 92.46, Timestamp('2021-09-29 10:55:34')],
       ['Item0', 26.0, 26.27, Timestamp('2021-10-01 06:57:05')],
       ['Item', 14.0, 13.61, Timestamp('2021-10-03 02:58:35')],
       ['Item4', 67.0, 67.28, Timestamp('2021-10-04 23:00:06')],
       ['Item1', 55.0, 54.59, Timestamp('2021-10-06 19:01:36')],
       ['Item4', nan, 26.24, Timestamp('2021-10-08 15:03:07')],
       ['Item6', nan, 47.81, Timestamp('2021-10-10 11:04:37')],
       ['Item3', 74.0, 74.03, Timestamp('2021-10-12 07:06:08')],
       ['Item3', 66.0, 65.76, Timestamp('2021-10-14 03:07:38')],
       ['Item', 45.0, 45.14, Timestamp('2021-10-15 23:09:09')],
       ['Item', 87.0, 86.86, Timestamp('2021-10-17 19:10:39')],
       ['Item', 27.0, 27.48, Timestamp('2021-10-19 15:12:09')],
       ['Item', 96.0, 95.74, Timestamp('2021-10-21 11:13:40')],
       ['Item1', 82.0, 82.36, Timestamp('2021-10-23 07:15:10')],
       ['Item0', 48.0, 47.63, Timestamp('2021-10-25 03:16:41')],
       ['Item6', 87.0, 87.11, Timestamp('2021-10-26 23:18:11')],
       ['Item3', 86.0, 85.88, Timestamp('2021-10-28 19:19:42')],
       ['Item2', 82.0, 81.56, Timestamp('2021-10-30 15:21:12')],
       ['Item', 81.0, 81.33, Timestamp('2021-11-01 11:22:43')],
       ['Item4', 89.0, 89.46, Timestamp('2021-11-03 07:24:13')],
       ['Item1', 19.0, 19.25, Timestamp('2021-11-05 03:25:44')],
       ['Item1', 55.0, 55.19, Timestamp('2021-11-06 23:27:14')],
       ['Item5', 90.0, 90.48, Timestamp('2021-11-08 19:28:44')],
       ['Item5', 86.0, 85.54, Timestamp('2021-11-10 15:30:15')],
       ['Item4', 97.0, 97.02, Timestamp('2021-11-12 11:31:45')],
       ['Item4', 96.0, nan, Timestamp('2021-11-14 07:33:16')],
       ['Item0', 55.0, 55.42, Timestamp('2021-11-16 03:34:46')],
       ['Item1', 33.0, 33.03, Timestamp('2021-11-17 23:36:17')],
       ['Item6', 94.0, 94.5, Timestamp('2021-11-19 19:37:47')],
       ['Item4', nan, 68.69, Timestamp('2021-11-21 15:39:18')],
       ['Item5', 33.0, 32.84, Timestamp('2021-11-23 11:40:48')],
       ['Item1', 39.0, 38.74, Timestamp('2021-11-25 07:42:18')],
       ['Item4', 25.0, 25.49, NaT],
       ['Item1', 52.0, 51.58, Timestamp('2021-11-28 23:45:19')],
       ['Item0', 83.0, 83.17, Timestamp('2021-11-30 19:46:50')],
       ['Item6', 90.0, 90.05, Timestamp('2021-12-02 15:48:20')],
       ['Item6', 20.0, 20.24, Timestamp('2021-12-04 11:49:51')],
       [nan, 26.0, 25.6, Timestamp('2021-12-06 07:51:21')],
       ['Item5', 25.0, 25.42, Timestamp('2021-12-08 03:52:52')],
       ['Item2', 97.0, 97.48, Timestamp('2021-12-09 23:54:22')],
       ['Item1', 93.0, 93.45, Timestamp('2021-12-11 19:55:53')],
       ['Item5', 93.0, 92.67, Timestamp('2021-12-13 15:57:23')],
       ['Item3', 78.0, 78.0, Timestamp('2021-12-15 11:58:53')],
       ['Item1', 10.0, 10.25, Timestamp('2021-12-17 08:00:24')],
       ['Item5', 13.0, 13.18, Timestamp('2021-12-19 04:01:54')],
       ['Item3', 22.0, 22.22, Timestamp('2021-12-21 00:03:25')],
       ['Item1', 83.0, 83.48, Timestamp('2021-12-22 20:04:55')],
       ['Item2', 96.0, 96.39, Timestamp('2021-12-24 16:06:26')],
       ['Item5', 41.0, 41.3, Timestamp('2021-12-26 12:07:56')],
       ['Item1', 99.0, 99.32, Timestamp('2021-12-28 08:09:27')],
       ['Item', nan, 94.38, Timestamp('2021-12-30 04:10:57')],
       ['Item0', 41.0, 41.21, Timestamp('2022-01-01 00:12:28')],
       ['Item3', 95.0, 95.19, Timestamp('2022-01-02 20:13:58')],
       ['Item', 33.0, 33.05, Timestamp('2022-01-04 16:15:28')],
       ['Item4', 52.0, 51.67, Timestamp('2022-01-06 12:16:59')],
       ['Item6', 52.0, 51.62, Timestamp('2022-01-08 08:18:29')],
       ['Item2', 93.0, 92.62, Timestamp('2022-01-10 04:20:00')],
       ['Item5', 57.0, 56.81, Timestamp('2022-01-12 00:21:30')],
       ['Item3', 54.0, 54.32, Timestamp('2022-01-13 20:23:01')],
       ['Item3', 96.0, 96.03, Timestamp('2022-01-15 16:24:31')],
       ['Item3', 14.0, 13.53, Timestamp('2022-01-17 12:26:02')],
       ['Item5', 17.0, 16.56, Timestamp('2022-01-19 08:27:32')],
       ['Item3', 26.0, 25.78, Timestamp('2022-01-21 04:29:03')],
       ['Item1', 53.0, 52.86, Timestamp('2022-01-23 00:30:33')],
       ['Item', nan, 27.45, Timestamp('2022-01-24 20:32:03')],
       ['Item1', 46.0, 46.25, Timestamp('2022-01-26 16:33:34')],
       ['Item3', 35.0, 34.6, Timestamp('2022-01-28 12:35:04')],
       ['Item6', 37.0, 36.62, Timestamp('2022-01-30 08:36:35')],
       ['Item3', 68.0, 67.84, Timestamp('2022-02-01 04:38:05')],
       ['Item4', 15.0, 15.14, Timestamp('2022-02-03 00:39:36')],
       ['Item6', 26.0, 25.62, Timestamp('2022-02-04 20:41:06')],
       ['Item3', 60.0, 59.63, Timestamp('2022-02-06 16:42:37')],
       ['Item5', 94.0, 93.77, Timestamp('2022-02-08 12:44:07')],
       ['Item1', 50.0, 49.7, Timestamp('2022-02-10 08:45:37')],
       ['Item', 98.0, 97.99, Timestamp('2022-02-12 04:47:08')],
       ['Item3', 96.0, 96.28, Timestamp('2022-02-14 00:48:38')],
       ['Item2', 19.0, 19.02, NaT],
       ['Item3', 29.0, 29.13, Timestamp('2022-02-17 16:51:39')],
       ['Item4', 49.0, 48.96, Timestamp('2022-02-19 12:53:10')],
       ['Item0', 77.0, nan, Timestamp('2022-02-21 08:54:40')],
       ['Item6', 56.0, 56.25, Timestamp('2022-02-23 04:56:11')],
       ['Item3', 30.0, 29.97, Timestamp('2022-02-25 00:57:41')],
       ['Item6', 76.0, 76.14, Timestamp('2022-02-26 20:59:12')],
       ['Item2', 52.0, 51.53, Timestamp('2022-02-28 17:00:42')],
       ['Item2', 44.0, 44.15, Timestamp('2022-03-02 13:02:12')],
       ['Item3', 10.0, 10.01, Timestamp('2022-03-04 09:03:43')],
       ['Item6', 50.0, 49.79, Timestamp('2022-03-06 05:05:13')],
       ['Item3', 29.0, 28.57, Timestamp('2022-03-08 01:06:44')],
       ['Item3', 37.0, 36.52, Timestamp('2022-03-09 21:08:14')],
       ['Item0', 28.0, 28.27, Timestamp('2022-03-11 17:09:45')],
       ['Item2', nan, 77.17, Timestamp('2022-03-13 13:11:15')],
       ['Item2', 38.0, 37.98, Timestamp('2022-03-15 09:12:46')],
       ['Item5', 53.0, 53.47, NaT],
       ['Item5', 17.0, 16.88, Timestamp('2022-03-19 01:15:47')],
       ['Item6', 90.0, 89.93, NaT],
       ['Item1', 67.0, 67.13, Timestamp('2022-03-22 17:18:47')],
       ['Item2', 81.0, 80.64, Timestamp('2022-03-24 13:20:18')],
       ['Item2', 89.0, 88.87, Timestamp('2022-03-26 09:21:48')],
       ['Item0', 16.0, 16.08, Timestamp('2022-03-28 05:23:19')],
       ['Item', 27.0, 26.73, Timestamp('2022-03-30 01:24:49')],
       ['Item', 14.0, 13.77, Timestamp('2022-03-31 21:26:20')],
       ['Item6', 88.0, 87.64, Timestamp('2022-04-02 17:27:50')],
       ['Item4', 74.0, 74.41, Timestamp('2022-04-04 13:29:21')],
       ['Item6', 16.0, 15.81, Timestamp('2022-04-06 09:30:51')],
       ['Item3', 91.0, 90.76, Timestamp('2022-04-08 05:32:22')],
       ['Item', 96.0, 96.02, Timestamp('2022-04-10 01:33:52')],
       ['Item2', 45.0, 44.51, Timestamp('2022-04-11 21:35:22')],
       ['Item4', 51.0, 50.96, Timestamp('2022-04-13 17:36:53')],
       ['Item2', 51.0, 51.04, Timestamp('2022-04-15 13:38:23')],
       ['Item5', 60.0, 59.81, Timestamp('2022-04-17 09:39:54')],
       ['Item5', 12.0, 12.07, Timestamp('2022-04-19 05:41:24')],
       ['Item0', 93.0, 93.09, Timestamp('2022-04-21 01:42:55')],
       ['Item3', 99.0, 99.21, Timestamp('2022-04-22 21:44:25')],
       ['Item6', 75.0, 74.83, Timestamp('2022-04-24 17:45:56')],
       ['Item0', 77.0, 77.25, Timestamp('2022-04-26 13:47:26')],
       ['Item6', 20.0, 20.34, Timestamp('2022-04-28 09:48:56')],
       ['Item1', nan, 29.71, Timestamp('2022-04-30 05:50:27')],
       ['Item4', 48.0, 48.42, Timestamp('2022-05-02 01:51:57')],
       ['Item6', 96.0, 95.66, Timestamp('2022-05-03 21:53:28')],
       ['Item6', 21.0, 20.69, Timestamp('2022-05-05 17:54:58')],
       ['Item1', 27.0, 26.62, Timestamp('2022-05-07 13:56:29')],
       ['Item1', 34.0, 33.73, Timestamp('2022-05-09 09:57:59')],
       ['Item', 33.0, 32.61, Timestamp('2022-05-11 05:59:30')],
       ['Item2', 71.0, 71.05, Timestamp('2022-05-13 02:01:00')],
       ['Item2', 65.0, 64.55, NaT],
       ['Item6', 42.0, nan, Timestamp('2022-05-16 18:04:01')],
       ['Item4', 31.0, 31.1, Timestamp('2022-05-18 14:05:31')],
       ['Item6', 80.0, 79.8, Timestamp('2022-05-20 10:07:02')],
       ['Item3', 81.0, 80.67, Timestamp('2022-05-22 06:08:32')],
       ['Item4', 52.0, 51.62, Timestamp('2022-05-24 02:10:03')],
       ['Item', 67.0, 67.07, Timestamp('2022-05-25 22:11:33')],
       ['Item2', 58.0, 58.21, Timestamp('2022-05-27 18:13:04')],
       ['Item5', 100.0, 99.62, Timestamp('2022-05-29 14:14:34')],
       ['Item1', 88.0, 88.03, Timestamp('2022-05-31 10:16:05')],
       ['Item', 62.0, 62.43, Timestamp('2022-06-02 06:17:35')],
       ['Item0', 23.0, 22.85, Timestamp('2022-06-04 02:19:06')],
       ['Item0', 85.0, 84.8, Timestamp('2022-06-05 22:20:36')],
       ['Item4', 98.0, 97.92, Timestamp('2022-06-07 18:22:06')],
       ['Item1', 86.0, 86.23, Timestamp('2022-06-09 14:23:37')],
       ['Item', 96.0, 96.47, Timestamp('2022-06-11 10:25:07')],
       ['Item3', 60.0, 59.73, Timestamp('2022-06-13 06:26:38')],
       ['Item1', 35.0, 34.53, Timestamp('2022-06-15 02:28:08')],
       ['Item', 65.0, 65.24, Timestamp('2022-06-16 22:29:39')],
       ['Item0', nan, 14.16, Timestamp('2022-06-18 18:31:09')],
       ['Item6', 15.0, nan, Timestamp('2022-06-20 14:32:40')],
       ['Item4', 17.0, 16.52, Timestamp('2022-06-22 10:34:10')],
       ['Item', 81.0, 81.0, Timestamp('2022-06-24 06:35:41')],
       ['Item4', 68.0, 68.04, Timestamp('2022-06-26 02:37:11')],
       ['Item3', 36.0, 36.48, NaT],
       ['Item0', 44.0, 43.86, Timestamp('2022-06-29 18:40:12')],
       ['Item', 96.0, 96.43, Timestamp('2022-07-01 14:41:42')],
       ['Item4', 95.0, 94.51, Timestamp('2022-07-03 10:43:13')],
       ['Item2', 65.0, 64.61, Timestamp('2022-07-05 06:44:43')],
       ['Item6', 92.0, 91.99, Timestamp('2022-07-07 02:46:14')],
       ['Item3', 70.0, 70.06, Timestamp('2022-07-08 22:47:44')],
       ['Item1', 79.0, 78.86, Timestamp('2022-07-10 18:49:15')],
       ['Item2', 30.0, 29.83, Timestamp('2022-07-12 14:50:45')],
       ['Item4', 20.0, 19.69, Timestamp('2022-07-14 10:52:15')],
       ['Item0', 79.0, 78.81, Timestamp('2022-07-16 06:53:46')],
       ['Item6', 21.0, 21.2, Timestamp('2022-07-18 02:55:16')],
       ['Item3', nan, 80.82, Timestamp('2022-07-19 22:56:47')],
       ['Item5', 90.0, 89.86, Timestamp('2022-07-21 18:58:17')],
       ['Item2', 35.0, 34.77, NaT],
       ['Item3', 46.0, 46.04, Timestamp('2022-07-25 11:01:18')],
       ['Item1', 27.0, nan, Timestamp('2022-07-27 07:02:49')],
       ['Item2', 96.0, 95.71, Timestamp('2022-07-29 03:04:19')],
       [nan, 76.0, 75.59, Timestamp('2022-07-30 23:05:50')],
       ['Item4', nan, 82.98, NaT]], dtype=object)

In [180]:
df.value_counts

<bound method DataFrame.value_counts of     CATEGORIA  VALOR  VALOR 2           Date&Time
0       Item4   87.0      NaN 2021-08-01 18:07:20
1        Item   46.0    45.58 2021-08-03 14:08:50
2       Item5   84.0    84.28 2021-08-05 10:10:21
3       Item0   35.0    35.04 2021-08-07 06:11:51
4       Item2   10.0    10.25 2021-08-09 02:13:22
..        ...    ...      ...                 ...
195     Item3   46.0    46.04 2022-07-25 11:01:18
196     Item1   27.0      NaN 2022-07-27 07:02:49
197     Item2   96.0    95.71 2022-07-29 03:04:19
198       NaN   76.0    75.59 2022-07-30 23:05:50
199     Item4    NaN    82.98                 NaT

[200 rows x 4 columns]>

In [181]:


df.rank()

     CATEGORIA  VALOR  VALOR 2  Date&Time
0        136.5  145.0      NaN        1.0
1         12.5   68.0     69.0        2.0
2        158.0  138.0    147.0        3.0
3         34.5   50.5     55.0        4.0
4         84.0    2.0      2.5        5.0
..         ...    ...      ...        ...
195      110.5   68.0     70.0      187.0
196       58.0   35.5      NaN      188.0
197       84.0  172.5    178.0      189.0
198        NaN  116.5    123.0      190.0
199      136.5    NaN    142.0        NaN

[200 rows x 4 columns]

In [182]:
df.sort_values(by=['VALOR 2','VALOR'], ascending=False)

    CATEGORIA  VALOR  VALOR 2           Date&Time
164     Item5  100.0    99.62 2022-05-29 14:14:34
81      Item1   99.0    99.32 2021-12-28 08:09:27
144     Item3   99.0    99.21 2022-04-22 21:44:25
106      Item   98.0    97.99 2022-02-12 04:47:08
169     Item4   98.0    97.92 2022-06-07 18:22:06
..        ...    ...      ...                 ...
111     Item0   77.0      NaN 2022-02-21 08:54:40
21      Item2   45.0      NaN 2021-09-09 06:38:59
157     Item6   42.0      NaN 2022-05-16 18:04:01
196     Item1   27.0      NaN 2022-07-27 07:02:49
176     Item6   15.0      NaN 2022-06-20 14:32:40

[200 rows x 4 columns]

In [183]:
df.sort_index(axis=1, ascending=False)

     VALOR 2  VALOR           Date&Time CATEGORIA
0        NaN   87.0 2021-08-01 18:07:20     Item4
1      45.58   46.0 2021-08-03 14:08:50      Item
2      84.28   84.0 2021-08-05 10:10:21     Item5
3      35.04   35.0 2021-08-07 06:11:51     Item0
4      10.25   10.0 2021-08-09 02:13:22     Item2
..       ...    ...                 ...       ...
195    46.04   46.0 2022-07-25 11:01:18     Item3
196      NaN   27.0 2022-07-27 07:02:49     Item1
197    95.71   96.0 2022-07-29 03:04:19     Item2
198    75.59   76.0 2022-07-30 23:05:50       NaN
199    82.98    NaN                 NaT     Item4

[200 rows x 4 columns]

In [184]:
df.astype(str).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   CATEGORIA  200 non-null    object
 1   VALOR      200 non-null    object
 2   VALOR 2    200 non-null    object
 3   Date&Time  200 non-null    object
dtypes: object(4)
memory usage: 6.4+ KB

In [185]:
df.iteritems

<bound method DataFrame.iteritems of     CATEGORIA  VALOR  VALOR 2           Date&Time
0       Item4   87.0      NaN 2021-08-01 18:07:20
1        Item   46.0    45.58 2021-08-03 14:08:50
2       Item5   84.0    84.28 2021-08-05 10:10:21
3       Item0   35.0    35.04 2021-08-07 06:11:51
4       Item2   10.0    10.25 2021-08-09 02:13:22
..        ...    ...      ...                 ...
195     Item3   46.0    46.04 2022-07-25 11:01:18
196     Item1   27.0      NaN 2022-07-27 07:02:49
197     Item2   96.0    95.71 2022-07-29 03:04:19
198       NaN   76.0    75.59 2022-07-30 23:05:50
199     Item4    NaN    82.98                 NaT

[200 rows x 4 columns]>

In [186]:
df.iterrows

<bound method DataFrame.iterrows of     CATEGORIA  VALOR  VALOR 2           Date&Time
0       Item4   87.0      NaN 2021-08-01 18:07:20
1        Item   46.0    45.58 2021-08-03 14:08:50
2       Item5   84.0    84.28 2021-08-05 10:10:21
3       Item0   35.0    35.04 2021-08-07 06:11:51
4       Item2   10.0    10.25 2021-08-09 02:13:22
..        ...    ...      ...                 ...
195     Item3   46.0    46.04 2022-07-25 11:01:18
196     Item1   27.0      NaN 2022-07-27 07:02:49
197     Item2   96.0    95.71 2022-07-29 03:04:19
198       NaN   76.0    75.59 2022-07-30 23:05:50
199     Item4    NaN    82.98                 NaT

[200 rows x 4 columns]>

In [187]:
for (name,series)  in df.iteritems():
    print(name)
    print(series)

CATEGORIA
0      Item4
1       Item
2      Item5
3      Item0
4      Item2
       ...
195    Item3
196    Item1
197    Item2
198      NaN
199    Item4
Name: CATEGORIA, Length: 200, dtype: object
VALOR
0      87.0
1      46.0
2      84.0
3      35.0
4      10.0
       ...
195    46.0
196    27.0
197    96.0
198    76.0
199     NaN
Name: VALOR, Length: 200, dtype: float64
VALOR 2
0        NaN
1      45.58
2      84.28
3      35.04
4      10.25
       ...
195    46.04
196      NaN
197    95.71
198    75.59
199    82.98
Name: VALOR 2, Length: 200, dtype: float64
Date&Time
0     2021-08-01 18:07:20
1     2021-08-03 14:08:50
2     2021-08-05 10:10:21
3     2021-08-07 06:11:51
4     2021-08-09 02:13:22
              ...
195   2022-07-25 11:01:18
196   2022-07-27 07:02:49
197   2022-07-29 03:04:19
198   2022-07-30 23:05:50
199                   NaT
Name: Date&Time, Length: 200, dtype: datetime64[ns]

In [188]:
df.count()

CATEGORIA    196
VALOR        185
VALOR 2      193
Date&Time    190
dtype: int64

In [189]:
print(df.isna().tail(200))

     CATEGORIA  VALOR  VALOR 2  Date&Time
0        False  False     True      False
1        False  False    False      False
2        False  False    False      False
3        False  False    False      False
4        False  False    False      False
..         ...    ...      ...        ...
195      False  False    False      False
196      False  False     True      False
197      False  False    False      False
198       True  False    False      False
199      False   True    False       True

[200 rows x 4 columns]

In [190]:
df.max()

C:\Users\Public\Documents\Wondershare\CreatorTemp\ipykernel_12740\1151452817.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.max()

VALOR                      100.0
VALOR 2                    99.62
Date&Time    2022-07-30 23:05:50
dtype: object

In [191]:
df.median()

C:\Users\Public\Documents\Wondershare\CreatorTemp\ipykernel_12740\530051474.py:1: FutureWarning: DataFrame.mean and DataFrame.median with numeric_only=None will include datetime64 and datetime64tz columns in a future version.
  df.median()
C:\Users\Public\Documents\Wondershare\CreatorTemp\ipykernel_12740\530051474.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.median()

VALOR      58.00
VALOR 2    58.21
dtype: float64

In [192]:
df.mode

<bound method DataFrame.mode of     CATEGORIA  VALOR  VALOR 2           Date&Time
0       Item4   87.0      NaN 2021-08-01 18:07:20
1        Item   46.0    45.58 2021-08-03 14:08:50
2       Item5   84.0    84.28 2021-08-05 10:10:21
3       Item0   35.0    35.04 2021-08-07 06:11:51
4       Item2   10.0    10.25 2021-08-09 02:13:22
..        ...    ...      ...                 ...
195     Item3   46.0    46.04 2022-07-25 11:01:18
196     Item1   27.0      NaN 2022-07-27 07:02:49
197     Item2   96.0    95.71 2022-07-29 03:04:19
198       NaN   76.0    75.59 2022-07-30 23:05:50
199     Item4    NaN    82.98                 NaT

[200 rows x 4 columns]>

In [193]:
df.min( )

C:\Users\Public\Documents\Wondershare\CreatorTemp\ipykernel_12740\870190874.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.min( )

VALOR                       10.0
VALOR 2                    10.01
Date&Time    2021-08-01 18:07:20
dtype: object

In [194]:
df.min().T

C:\Users\Public\Documents\Wondershare\CreatorTemp\ipykernel_12740\1185237449.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.min().T

VALOR                       10.0
VALOR 2                    10.01
Date&Time    2021-08-01 18:07:20
dtype: object

In [195]:
df.sum()

C:\Users\Public\Documents\Wondershare\CreatorTemp\ipykernel_12740\1703867807.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.sum()

VALOR      10810.00
VALOR 2    11220.21
dtype: float64

In [196]:
#crea una funcion que sume 2 al parametro de entradas
def sumamasdos(x):
    return x+2

In [197]:
sumamasdos(4)

6

In [198]:
df['SUMA DOS'] = df.apply(lambda x: sumamasdos(x['VALOR 2']), axis=1)

In [199]:
df

    CATEGORIA  VALOR  VALOR 2           Date&Time  SUMA DOS
0       Item4   87.0      NaN 2021-08-01 18:07:20       NaN
1        Item   46.0    45.58 2021-08-03 14:08:50     47.58
2       Item5   84.0    84.28 2021-08-05 10:10:21     86.28
3       Item0   35.0    35.04 2021-08-07 06:11:51     37.04
4       Item2   10.0    10.25 2021-08-09 02:13:22     12.25
..        ...    ...      ...                 ...       ...
195     Item3   46.0    46.04 2022-07-25 11:01:18     48.04
196     Item1   27.0      NaN 2022-07-27 07:02:49       NaN
197     Item2   96.0    95.71 2022-07-29 03:04:19     97.71
198       NaN   76.0    75.59 2022-07-30 23:05:50     77.59
199     Item4    NaN    82.98                 NaT     84.98

[200 rows x 5 columns]

In [202]:
df

    CATEGORIA  VALOR  VALOR 2           Date&Time  SUMA DOS
0       Item4   87.0      NaN 2021-08-01 18:07:20       NaN
1        Item   46.0    45.58 2021-08-03 14:08:50     47.58
2       Item5   84.0    84.28 2021-08-05 10:10:21     86.28
3       Item0   35.0    35.04 2021-08-07 06:11:51     37.04
4       Item2   10.0    10.25 2021-08-09 02:13:22     12.25
..        ...    ...      ...                 ...       ...
195     Item3   46.0    46.04 2022-07-25 11:01:18     48.04
196     Item1   27.0      NaN 2022-07-27 07:02:49       NaN
197     Item2   96.0    95.71 2022-07-29 03:04:19     97.71
198       NaN   76.0    75.59 2022-07-30 23:05:50     77.59
199     Item4    NaN    82.98                 NaT     84.98

[200 rows x 5 columns]

In [205]:
df['nuevo']=df['VALOR 2'].where(df['VALOR 2'] > 60, -1)

In [206]:
df

    CATEGORIA  VALOR  VALOR 2           Date&Time  SUMA DOS  nuevo
0       Item4   87.0      NaN 2021-08-01 18:07:20       NaN  -1.00
1        Item   46.0    45.58 2021-08-03 14:08:50     47.58  -1.00
2       Item5   84.0    84.28 2021-08-05 10:10:21     86.28  84.28
3       Item0   35.0    35.04 2021-08-07 06:11:51     37.04  -1.00
4       Item2   10.0    10.25 2021-08-09 02:13:22     12.25  -1.00
..        ...    ...      ...                 ...       ...    ...
195     Item3   46.0    46.04 2022-07-25 11:01:18     48.04  -1.00
196     Item1   27.0      NaN 2022-07-27 07:02:49       NaN  -1.00
197     Item2   96.0    95.71 2022-07-29 03:04:19     97.71  95.71
198       NaN   76.0    75.59 2022-07-30 23:05:50     77.59  75.59
199     Item4    NaN    82.98                 NaT     84.98  82.98

[200 rows x 6 columns]

In [213]:
df['CATEGORIA'].to_list()

['Item4',
 'Item',
 'Item5',
 'Item0',
 'Item2',
 nan,
 'Item0',
 'Item0',
 'Item4',
 'Item6',
 'Item6',
 'Item1',
 'Item1',
 'Item',
 'Item0',
 'Item6',
 'Item1',
 'Item4',
 'Item',
 'Item2',
 'Item2',
 'Item2',
 nan,
 'Item0',
 'Item5',
 'Item3',
 'Item6',
 'Item6',
 'Item1',
 'Item2',
 'Item6',
 'Item',
 'Item5',
 'Item0',
 'Item',
 'Item4',
 'Item1',
 'Item4',
 'Item6',
 'Item3',
 'Item3',
 'Item',
 'Item',
 'Item',
 'Item',
 'Item1',
 'Item0',
 'Item6',
 'Item3',
 'Item2',
 'Item',
 'Item4',
 'Item1',
 'Item1',
 'Item5',
 'Item5',
 'Item4',
 'Item4',
 'Item0',
 'Item1',
 'Item6',
 'Item4',
 'Item5',
 'Item1',
 'Item4',
 'Item1',
 'Item0',
 'Item6',
 'Item6',
 nan,
 'Item5',
 'Item2',
 'Item1',
 'Item5',
 'Item3',
 'Item1',
 'Item5',
 'Item3',
 'Item1',
 'Item2',
 'Item5',
 'Item1',
 'Item',
 'Item0',
 'Item3',
 'Item',
 'Item4',
 'Item6',
 'Item2',
 'Item5',
 'Item3',
 'Item3',
 'Item3',
 'Item5',
 'Item3',
 'Item1',
 'Item',
 'Item1',
 'Item3',
 'Item6',
 'Item3',
 'Item4',
 'Item6',
 'Item3',
 'Item5',
 'Item1',
 'Item',
 'Item3',
 'Item2',
 'Item3',
 'Item4',
 'Item0',
 'Item6',
 'Item3',
 'Item6',
 'Item2',
 'Item2',
 'Item3',
 'Item6',
 'Item3',
 'Item3',
 'Item0',
 'Item2',
 'Item2',
 'Item5',
 'Item5',
 'Item6',
 'Item1',
 'Item2',
 'Item2',
 'Item0',
 'Item',
 'Item',
 'Item6',
 'Item4',
 'Item6',
 'Item3',
 'Item',
 'Item2',
 'Item4',
 'Item2',
 'Item5',
 'Item5',
 'Item0',
 'Item3',
 'Item6',
 'Item0',
 'Item6',
 'Item1',
 'Item4',
 'Item6',
 'Item6',
 'Item1',
 'Item1',
 'Item',
 'Item2',
 'Item2',
 'Item6',
 'Item4',
 'Item6',
 'Item3',
 'Item4',
 'Item',
 'Item2',
 'Item5',
 'Item1',
 'Item',
 'Item0',
 'Item0',
 'Item4',
 'Item1',
 'Item',
 'Item3',
 'Item1',
 'Item',
 'Item0',
 'Item6',
 'Item4',
 'Item',
 'Item4',
 'Item3',
 'Item0',
 'Item',
 'Item4',
 'Item2',
 'Item6',
 'Item3',
 'Item1',
 'Item2',
 'Item4',
 'Item0',
 'Item6',
 'Item3',
 'Item5',
 'Item2',
 'Item3',
 'Item1',
 'Item2',
 nan,
 'Item4']